Autodesk.Navisworks.Api.Schema.SimpleField
Intermediate base class for all simple value Fields.

Autodesk.Navisworks.Api.Schema.SimpleField.IsReadOnly
Gets a value indicating whether the object is read-only.